{
  "name": "First Night",
  "icon": "minecraft:black_concrete",
  "category": "pvzmod:tutorial_category",
  "sortnum": 1,
  "pages": [
    {
      "type": "text",
      "text": [
        "The sun sets, the mushrooms wake up, and the danger increases.",
        "$(br2)In dark areas on and near the surface a new grave type will spawn, the Night Grave. ",
        "This grave is dangerous, because it can spawn zombies tougher than before.",
        "$(br2)If you didn't do this already, it's recommended to place some potato mines near your plants."
        ]
    },
    {
      "type": "text",
      "text": [
        "$(br2)Mushrooms are nocturnal Plants, meaning that they can only function when it's dark.",
        "$(br2)To make mushrooms you will need Mushroom Plant Food, they are acquired by harvesting either a ",
        "Button-shroom (Day spawn) or a Puff-shroom (Night spawn).",
        "$(br)After getting some Mushroom Plant Food make some new Plants."
      ]
    },
    {
      "type": "crafting",
      "recipe": "pvzmod:plants/ailment/scaredyshroom",
      "text": [
        "$(br2)Scaredy-shroom will deal with zombies from afar, helping thinning their numbers. They also poison the target."
      ]
    },
    {
      "type": "crafting",
      "recipe": "pvzmod:plants/ailment/fumeshroompvz",
      "text": [
        "The next plant you can make is the Fume-shroom. It's a better Bellflower.",
        "$(br2)Fume-shrooms are good crowd controlling plants."
      ]
    },
    {
      "type": "text",
      "text": [
        "$(br2)One of the main uses of the Fume-shroom is dealing with shielded zombies, like the Screen Door Zombie, as it will deal direct damage to the zombie instead of the shield.",
        "$(br2)Just don't depend on it to deal with Newspaper Zombies, as they have way more non-shield health and will quickly eat the Fume-shroom after being attacked."
      ]
    },
    {
      "type": "text",
      "text": [
        "$(br)While these mushrooms are great for their cost, be mindful of depending on them at this stage of the game, as they will fall asleep during daytime.",
        "$(br2)The more days pass, the tougher the zombies get, so it's recommended to stay awake during the night to get more resources instead of sleeping.",
        "$(br2)Here are some other Mushrooms you can make:"
      ]
    },
    {
      "type": "relations",
      "entries": [
        "pvzmod:plants/puffshroom_entry",
        "pvzmod:plants/scaredyshroom_entry",
        "pvzmod:plants/fumeshroom_entry",
        "pvzmod:plants/hypnoshroom_entry",
        "pvzmod:plants/iceshroom_entry",
        "pvzmod:plants/doomshroom_entry"
      ],
      "title": "Recommended Plants:"
    }
  ]
}
