{
  "name": "Tip: Environmental Modifiers",
  "icon": "pvzmod:premium_tile",
  "category": "pvzmod:tutorial_category",
  "sortnum": 10,
  "pages": [
    {
      "type": "text",
      "text": [
        "Environmental Modifiers are mechanics that change the environment and how Plants and Zombies interact with it.",
        "$(br2)There are many types of Environmental Modifiers, here's a list of all of them:"
      ]
    },
    {
      "type": "text",
      "text": [
        "$(br2)Crater Tile",
        "$(br2)Craters prevent non-flying plants from being planted on them.",
        "$(br2)They can be removed by right clicking them with a Sun."
      ]
    },
    {
      "type": "text",
      "text": [
        "$(br)Scorched Tile",
        "$(br)They prevent non-flying Plants, Plants not immune to Fire, and Plants that are not icy or watery from being able to be planted on them. ",
        "Using an Iceberg Lettuce on them will destroy them. Ice or Water attacks that damage the field (e.g. Ice-shroom, Chilly Pepper, etc.) destroy them. ",
        "Planting icy or watery Plants on top of them instantly destroys them. ",
        "They last for 1 minute. They spawn an Imp Dragon Zombie every 18 seconds."

      ]
    },
    {
      "type": "text",
      "text": [
        "$(br)Ice Tile",
        "$(br)They apply Chill to non-flying Zombies that are close to them. ",
        "$(br)They are destroyed by fire attacks that damage the field (e.g. Cherry Bomb, Jalapeno, etc.)."
      ]
    },
    {
      "type": "text",
      "text": [
        "$(br)Gold Tile",
        "$(br2)Gold Tile produces one Small Sun every 3 minutes if there's a non-flying Plant on top of them. The Zombie Sun Radius is 10 blocks.",
        "$(br2)They can be removed by right clicking them with a Gold Shovel."

      ]
    },
    {
      "type": "relations",
      "entries": [
        "pvzmod:plants/trashcan_entry",
        "pvzmod:plants/basketballcarrier_entry",
        "pvzmod:plants/torchlight_entry",
        "pvzmod:plants/iceberglettuce_entry",
        "pvzmod:plants/torchwood_entry",
        "pvzmod:plants/doomshroom_entry",
        "pvzmod:plants/smackadamia_entry",
        "pvzmod:plants/goldleaf_entry"
      ]
    }
  ]
}
